[
    {
        "text" : "My journey into technology started at a young age when I wrote my first line of code at 13. What began as simple curiosity quickly grew into a passion for building digital experiences. Over time, I explored different programming languages, experimented with small projects, and immersed myself in the logic and creativity of software development. This early start shaped the foundation of my career and gave me the confidence to continuously adapt to new technologies and frameworks.",
        "highlights" : [
            "First line of code at 13",
            "Early passion for software development",
            "Strong foundation in problem-solving"
        ]
    },
    {
        "text": "As I moved further into the industry, I began focusing on creating modern web applications and interactive experiences. My love for motion design and user engagement naturally led me into UI/UX design, where I embraced a design-first approach. This helped me understand not only how to write efficient code but also how to make products visually appealing and intuitive for end users. I believe that great design and great code go hand in hand to deliver impactful digital products.",
        "highlights": [
            "3 years of industry experience",
            "Transition from coding to design-first approach",
            "Strong background in UI/UX design and motion design"
        ]
    },
    {
    "text": "Throughout my professional career, I’ve worked on various projects that span both web and mobile development. From building responsive websites to creating mobile applications, I’ve learned to adapt quickly to different platforms and project requirements. This flexibility has helped me collaborate effectively with cross-functional teams and contribute to delivering products that meet both technical and business goals.",
        "highlights": [
            "Experience in both web and mobile development",
            "Responsive design and cross-platform focus",
            "Team collaboration and adaptability"
        ]
    },
    {
    "text": "Beyond coding, I've continuosly improved my communication skills by working closely with designers, testers, and project managers. These experiences have strengthened my ability to share ideas clearly, manage project requirement, and solve problems efficienly with a team. I value collaboration because I believe the best products come from divers perspectives and teamwork.",
        "highlights": [
            "Strong communication and teamworkC",
            "Experience working with cross-unctional teams",
            "Problem solving in collaborative environments"
        ]
    },
    {
    "text": "Today, I continue to grow as a developer with a passion for creating scalable, user-centered, and impactful digital products. Whether it’s building a feature-rich mobile application or architecting a responsive web platform, I aim to balance technical excellence with user satisfaction. My long-term goal is to keep learning, innovating, and contributing to projects that push boundaries and deliver meaningful solutions.",
        "highlights": [
            "Focus on scalable and user-centered products",
            "Balance between technical excellence and user satisfaction",
            "Commitment to continuous learning and innovation"
        ]
    }  
]